avnet-iotconnect/iotc-mchp-dspic33ck-lvmcb/firmware/dspic33ck256mp508_rnwf11_iotconnect.X/iotconnect/iotconnect_rnwf11.c
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <xc.h>
#include "clock.h"
#include <libpic30.h> /* needs FCY from clock.h */
#include "debug_console.h"
#include "uart2.h"
#include "iotconnect_rnwf11.h"
#include "iotconnect_rnwf11_config.h"
#include "iotcl.h"
#include "iotcl_telemetry.h"
#include "../hal/device_config.h"
#include "../hal/nvm_flash.h"
#include "../motor_commands.h"
#include "provisioning.h"

#define IOTC_RNWF11_RESPONSE_SIZE 384U
#define IOTC_RNWF11_COMMAND_TIMEOUT 5000000UL
#define IOTC_RNWF11_PROBE_TIMEOUT 200000UL
#define IOTC_RNWF11_WIFI_WAIT_MS 20000UL

static bool iotcConnected;
static bool iotcModulePresent;
static volatile uint32_t telemetryMilliseconds;
static volatile uint32_t retryMilliseconds;
static IOTC_RNWF11_Telemetry_t telemetry;
static char lastResponse[IOTC_RNWF11_RESPONSE_SIZE];
static bool lastOverrun;
static bool mqttLinkUp;
/* Assume up: the module stays associated across dsPIC resets and only
 * re-announces its IP on a fresh association. */
static bool netUp = true;

/* Set by PollEvents() when an unsolicited "+MQTTSUBRX:" line carries a C2D
 * message; consumed by Task(), never from inside PollEvents() itself - see
 * the "+MQTTSUBRX:" handling note there. The module inlines the payload
 * directly in that line for messages under its read threshold (AT+MQTTC=9,
 * 128 bytes by default), which every C2D command this firmware supports is
 * well under. A payload at or above that threshold is not handled (per
 * Microchip's Appendix A.5, AT+MQTTSUBRD would be needed instead, but that
 * path is unverified against real hardware and unnecessary for our short
 * commands). */
#define IOTC_RNWF11_C2D_TOPIC_MAX 128U
#define IOTC_RNWF11_C2D_PAYLOAD_MAX 256U
static bool pendingC2dMessage;
static char pendingC2dPayload[IOTC_RNWF11_C2D_PAYLOAD_MAX];
static size_t pendingC2dPayloadLen;

/* Populated at boot from flash (see IOTC_RNWF11_Initialize()) if the
 * device has been provisioned via tools/provision_device_config.py/.ps1,
 * falling back to the compile-time IOTC_* defaults below otherwise - see
 * device_config.h. Updated in place by IOTC_RNWF11_CheckProvisioning()
 * whenever a new provisioning request comes in over the console. */
static device_config_t s_cfg;

static bool IOTC_RNWF11_IsConfigured(void)
{
    return (s_cfg.wifi_ssid[0] != '\0') &&
           (s_cfg.mqtt_broker_host[0] != '\0') &&
           (s_cfg.mqtt_client_id[0] != '\0') &&
           (s_cfg.mqtt_pub_topic[0] != '\0');
}

static void IOTC_RNWF11_UART2_Initialize(void)
{
    UART2_Initialize(IOTC_RNWF11_BAUD);
}

/* The module echoes every character, so keep draining while transmitting. */
static void IOTC_RNWF11_Collect(uint16_t *length)
{
    while (UART2_IsReceiveDataAvailable())
    {
        char c = (char)UART2_Read();
        if (*length < (IOTC_RNWF11_RESPONSE_SIZE - 1U))
        {
            lastResponse[*length] = c;
            (*length)++;
            lastResponse[*length] = '\0';
        }
    }
}

/* The module echoes every character; discard it so long commands still fit. */
static void IOTC_RNWF11_DiscardEcho(void)
{
    while (UART2_IsReceiveDataAvailable())
    {
        (void)UART2_Read();
    }
}

static void IOTC_RNWF11_Write(const char *text)
{
    while (*text != '\0')
    {
        UART2_Write((uint8_t)*text++);
        while (!UART2_IsTransmitComplete())
        {
            IOTC_RNWF11_DiscardEcho();
        }
        IOTC_RNWF11_DiscardEcho();
    }
}

static void IOTC_RNWF11_PollEvents(void);
static void IOTC_RNWF11_OnCommand(IotclC2dEventData data);
static void IOTC_RNWF11_SendCmdAck(const char *ack_id, int status, const char *message);

static bool IOTC_RNWF11_CommandWithTimeout(const char *command, uint32_t timeout)
{
    uint16_t length = 0;

    /* Print anything pending rather than discarding a failure notification. */
    IOTC_RNWF11_PollEvents();

    lastResponse[0] = '\0';
    UART2_ReceiveFlush();
    lastOverrun = false;

    IOTC_RNWF11_Write(command);

    while (timeout-- != 0U)
    {
        IOTC_RNWF11_Collect(&length);
        if (UART2_IsOverrun())
        {
            lastOverrun = true;
            UART2_ClearOverrun();
        }
        if (strstr(lastResponse, "ERROR") != NULL)
        {
            return false;
        }
        if (strstr(lastResponse, "OK") != NULL)
        {
            return true;
        }
    }
    return false;
}

static bool IOTC_RNWF11_Command(const char *command)
{
    return IOTC_RNWF11_CommandWithTimeout(command, IOTC_RNWF11_COMMAND_TIMEOUT);
}

/* Labelled so failures are traceable without printing Wi-Fi credentials. */
static bool IOTC_RNWF11_Step(const char *label, const char *command)
{
    if (IOTC_RNWF11_Command(command))
    {
        return true;
    }
    DEBUG_Printf("IOTC: step %s failed%s, resp=[%s]\r\n",
                 label, lastOverrun ? " (rx overrun)" : "",
                 (lastResponse[0] != '\0') ? lastResponse : "<timeout>");
    return false;
}

/* Sends a query and prints whatever comes back, ignoring OK/ERROR. */
static void IOTC_RNWF11_Query(const char *command)
{
    uint16_t length = 0;

    lastResponse[0] = '\0';
    UART2_ReceiveFlush();
    IOTC_RNWF11_Write(command);

    for (uint16_t slice = 0; slice < 2000U; slice++)
    {
        __delay_us(250);
        IOTC_RNWF11_Collect(&length);
    }
    DEBUG_Printf("IOTC: query -> [%s]\r\n", lastResponse);
}

static void IOTC_RNWF11_Diagnose(void)
{
    static const char *const queries[] = {
        "AT+TIME\r\n",     /* confirm SNTP supplied a valid clock */
        "AT+TLSC=1\r\n",   /* did the certificate names actually stick */
        "AT+MQTTC\r\n",    /* host, port, client id, TLS selection */
    };

    DEBUG_Printf("IOTC: --- diagnostics ---\r\n");
    for (uint16_t i = 0; i < (sizeof(queries) / sizeof(queries[0])); i++)
    {
        IOTC_RNWF11_Query(queries[i]);
    }
    DEBUG_Printf("IOTC: --- end ---\r\n");
}

/* Expected to fail once the station is associated, so do not log it. */
static void IOTC_RNWF11_StepQuiet(const char *command)
{
    (void)IOTC_RNWF11_Command(command);
}

/* Best effort: the module may already keep time, so a failure is not fatal. */
static void IOTC_RNWF11_StepOptional(const char *label, const char *command)
{
    (void)IOTC_RNWF11_Step(label, command);
}

static bool IOTC_RNWF11_WaitForNetwork(void)
{
    netUp = false;
    /* Close any MQTT session first - tearing down WiFi out from under a
     * still-open MQTT session (below) leaves the module's own MQTT client
     * state confused, which was seen to make every later AT+MQTTCONN=1
     * fail instantly even after a fresh WiFi reassociation. Only the very
     * first connect attempt after a full power cycle ever worked. */
    IOTC_RNWF11_StepQuiet("AT+MQTTDISCONN\r\n");
    /* Force a real disconnect+reconnect: AT+WSTA=1 alone is a no-op if the
     * module is already associated from a prior boot (host resets/reflashes
     * don't power-cycle the module), which was seen to reach MQTTCONN in a
     * state that consistently fails - a genuinely fresh association is the
     * one thing that correlated with MQTTCONN actually succeeding. */
    IOTC_RNWF11_StepQuiet("AT+WSTA=0\r\n");
    IOTC_RNWF11_StepQuiet("AT+WSTA=1\r\n");

    for (uint32_t elapsed = 0; elapsed < IOTC_RNWF11_WIFI_WAIT_MS; elapsed++)
    {
        IOTC_RNWF11_PollEvents();
        if (netUp)
        {
            return true;
        }
        __delay_ms(1);
    }
    DEBUG_Printf("IOTC: step WiFi-IP failed\r\n");
    return false;
}

