avnet-iotconnect/iotc-mchp-dspic33ck-lvmcb/firmware/dspic33ck256mp508_rnwf11_iotconnect.X/iotconnect/iotconnect_rnwf11.c
    char *json = iotcl_telemetry_create_serialized_string(msg, false);
    iotcl_telemetry_destroy(msg);
    if (json == NULL)
    {
        DEBUG_Printf("IOTC: iotcl_telemetry_create_serialized_string failed\r\n");
        return false;
    }

    char escaped[IOTC_RNWF11_ESCAPED_JSON_MAX];
    bool escapedOk = IOTC_RNWF11_EscapeJsonForAtCommand(json, escaped, sizeof(escaped));

    bool sent = false;
    if (!escapedOk)
    {
        DEBUG_Printf("IOTC: telemetry JSON too long to escape (%s)\r\n", json);
    }
    else
    {
        char command[384];
        int written = snprintf(command, sizeof(command), "AT+MQTTPUB=1,1,0,\"%s\",\"%s\"\r\n",
                                s_cfg.mqtt_pub_topic, escaped);
        if ((written < 0) || ((size_t)written >= sizeof(command)))
        {
            DEBUG_Printf("IOTC: telemetry command too long to send\r\n");
        }
        else
        {
            sent = IOTC_RNWF11_Step("MQTTPUB", command);
        }
    }

    iotcl_telemetry_destroy_serialized_string(json);
    return sent;
}

/* Only ever called from the top level of Task()/OnCommand(), never from
 * inside PollEvents() - see the "+MQTTSUBRX:" handling note above. */
static void IOTC_RNWF11_SendCmdAck(const char *ack_id, int status, const char *message)
{
    if (s_cfg.mqtt_ack_topic[0] == '\0')
    {
        return;
    }

    char *json = iotcl_c2d_create_cmd_ack_json(ack_id, status, message);
    if (json == NULL)
    {
        DEBUG_Printf("IOTC: iotcl_c2d_create_cmd_ack_json failed\r\n");
        return;
    }

    char escaped[IOTC_RNWF11_ESCAPED_JSON_MAX];
    if (IOTC_RNWF11_EscapeJsonForAtCommand(json, escaped, sizeof(escaped)))
    {
        char command[384];
        int written = snprintf(command, sizeof(command), "AT+MQTTPUB=0,1,0,\"%s\",\"%s\"\r\n",
                                s_cfg.mqtt_ack_topic, escaped);
        if ((written >= 0) && ((size_t)written < sizeof(command)))
        {
            (void)IOTC_RNWF11_Step("MQTTPUB-ack", command);
        }
    }
    else
    {
        DEBUG_Printf("IOTC: ack JSON too long to escape (%s)\r\n", json);
    }

    iotcl_c2d_destroy_ack_json(json);
}

/* Registered as events.cmd_cb in IOTC_RNWF11_Initialize(). Invoked
 * synchronously from within iotcl_mqtt_receive_c2d_with_length(), called only
 * from the top level of Task() (see its pendingC2dMessage handling), so it's
 * safe to issue AT commands (for the ack) from here. */
static void IOTC_RNWF11_OnCommand(IotclC2dEventData data)
{
    const char *ack_id = iotcl_c2d_get_ack_id(data);
    const char *raw_command = iotcl_c2d_get_command(data);
    if (raw_command == NULL)
    {
        return;
    }

    /* Despite iotcl_c2d_get_command()'s header comment ("returns a malloc-ed
     * copy... must be freed"), the pinned iotc-c-lib version actually returns
     * cJSON_GetStringValue()'s raw pointer straight into the parsed tree, not
     * a copy - freeing it here double-frees it when iotcl_c2d_destroy_event()
     * (called automatically right after this callback returns) deletes the
     * whole tree, corrupting the heap. Copy it out; do not free raw_command. */
    char command[64];
    snprintf(command, sizeof(command), "%s", raw_command);

    char *arg = strchr(command, ' ');
    if (arg != NULL)
    {
        *arg = '\0';
        arg++;
    }

    int status = IOTCL_C2D_EVT_CMD_SUCCESS_WITH_ACK;
    const char *message = NULL;

    if (strcmp(command, "motor-start") == 0)
    {
        MCAPP_MotorStart();
    }
    else if (strcmp(command, "motor-stop") == 0)
    {
        MCAPP_MotorStop();
    }
    else if (strcmp(command, "motor-reverse") == 0)
    {
        MCAPP_MotorReverse();
    }
    else if (strcmp(command, "motor-speed") == 0)
    {
        char *endptr = NULL;
        long percent = (arg != NULL) ? strtol(arg, &endptr, 10) : 0;
        if ((arg == NULL) || (endptr == arg) || (*endptr != '\0'))
        {
            status = IOTCL_C2D_EVT_CMD_FAILED;
            message = "motor-speed requires an integer 0-100 percent argument";
        }
        else
        {
            /* Clamp before the uint8_t cast below - clamping after would let
             * an out-of-range value (e.g. 300) wrap modulo 256 instead. */
            if (percent < 0)
            {
                percent = 0;
            }
            else if (percent > 100)
            {
                percent = 100;
            }
            MCAPP_MotorSetSpeedPercent((uint8_t)percent);
        }
    }
    else
    {
        status = IOTCL_C2D_EVT_CMD_FAILED;
        message = "unknown command";
    }

    DEBUG_Printf("IOTC: command \"%s%s%s\" -> %s\r\n", command, arg ? " " : "", arg ? arg : "",
                 (status == IOTCL_C2D_EVT_CMD_SUCCESS_WITH_ACK) ? "ok" : "failed");

    if (ack_id != NULL)
    {
        IOTC_RNWF11_SendCmdAck(ack_id, status, message);
    }
}

void IOTC_RNWF11_Initialize(void)
{
#if IOTC_RNWF11_ENABLE
    IOTC_RNWF11_UART2_Initialize();
    iotcModulePresent = IOTC_RNWF11_CommandWithTimeout("AT\r\n", IOTC_RNWF11_PROBE_TIMEOUT);
    iotcConnected = false;

    if (DEVICE_CONFIG_Load(&s_cfg))
    {
        DEBUG_Printf("IOTC: loaded provisioned config for client %s\r\n", s_cfg.mqtt_client_id);
    }
    else
    {
        // Not yet provisioned (or flash was blank/corrupt) - fall back to
        // the compile-time defaults so the board still works exactly as
        // before without going through tools/provision_device_config.py/.ps1.
        // Also the one safe moment to self-test the flash driver: this
        // page holds no valid config yet, so there is nothing to lose.
        snprintf(s_cfg.wifi_ssid, sizeof(s_cfg.wifi_ssid), "%s", IOTC_WIFI_SSID);
        snprintf(s_cfg.wifi_password, sizeof(s_cfg.wifi_password), "%s", IOTC_WIFI_PASSWORD);
        snprintf(s_cfg.mqtt_broker_host, sizeof(s_cfg.mqtt_broker_host), "%s", IOTC_MQTT_BROKER_HOST);
        s_cfg.mqtt_broker_port = IOTC_MQTT_BROKER_PORT;
        snprintf(s_cfg.mqtt_client_id, sizeof(s_cfg.mqtt_client_id), "%s", IOTC_MQTT_CLIENT_ID);
        snprintf(s_cfg.mqtt_username, sizeof(s_cfg.mqtt_username), "%s", IOTC_MQTT_USERNAME);
        snprintf(s_cfg.mqtt_pub_topic, sizeof(s_cfg.mqtt_pub_topic), "%s", IOTC_MQTT_TELEMETRY_TOPIC);
        snprintf(s_cfg.mqtt_c2d_topic, sizeof(s_cfg.mqtt_c2d_topic), "%s", IOTC_MQTT_C2D_TOPIC);
        snprintf(s_cfg.mqtt_ack_topic, sizeof(s_cfg.mqtt_ack_topic), "%s", IOTC_MQTT_ACK_TOPIC);
        snprintf(s_cfg.rnwf_ca_name, sizeof(s_cfg.rnwf_ca_name), "%s", IOTC_RNWF11_CA_NAME);
        snprintf(s_cfg.rnwf_cert_name, sizeof(s_cfg.rnwf_cert_name), "%s", IOTC_RNWF11_CERT_NAME);
        snprintf(s_cfg.rnwf_key_name, sizeof(s_cfg.rnwf_key_name), "%s", IOTC_RNWF11_KEY_NAME);

        DEBUG_Printf("IOTC: not provisioned, using compile-time config; flash self-test %s\r\n",
                     NVM_FLASH_SelfTest() ? "PASS" : "FAIL");
    }

    IotclClientConfig iotcl_cfg;
    iotcl_init_client_config(&iotcl_cfg);
    iotcl_cfg.device.instance_type = IOTCL_DCT_CUSTOM; // broker/topic are resolved at provisioning time - see iotconnect_rnwf11_config.h
    iotcl_cfg.events.cmd_cb = IOTC_RNWF11_OnCommand;
    iotcl_init(&iotcl_cfg);

#if !IOTC_RNWF11_RX_RPn
    DEBUG_Printf("IOTC: UART2 pins unset, set IOTC_RNWF11_RX_RPn/TX_RPnR\r\n");
#endif
    DEBUG_Printf("IOTC: module %s, config %s\r\n",
                 iotcModulePresent ? "detected" : "not responding",
                 IOTC_RNWF11_IsConfigured() ? "ok" : "incomplete");
#else
    iotcModulePresent = false;
    iotcConnected = false;
#endif
}

void IOTC_RNWF11_CheckProvisioning(void)
{
#if IOTC_RNWF11_ENABLE
    if (PROVISIONING_CheckForRequest())
    {
        device_config_t new_cfg;
        if (PROVISIONING_RunOnce(&new_cfg))
        {
            s_cfg = new_cfg;
            iotcConnected = false;              // force a fresh connect with the new config
            mqttLinkUp = false;
            retryMilliseconds = IOTC_RETRY_PERIOD_MS; // don't wait out the retry timer
            DEBUG_Printf("IOTC: reprovisioned, reconnecting\r\n");
        }
    }
#endif
}

void IOTC_RNWF11_Tick1ms(void)
{
#if IOTC_RNWF11_ENABLE
    telemetryMilliseconds++;
    retryMilliseconds++;
#endif
}

void IOTC_RNWF11_SetTelemetry(const IOTC_RNWF11_Telemetry_t *sample)
{
    telemetry = *sample;
}

