avnet-iotconnect/iotc-mchp-dspic33ck-lvmcb/firmware/dspic33ck256mp508_rnwf11_iotconnect.X/iotconnect/iotconnect_rnwf11.c
/*
 * The module reports real connection state asynchronously; command replies only
 * say whether the command itself was accepted.
 */
static void IOTC_RNWF11_PollEvents(void)
{
    static char line[128];
    static uint16_t len;

    while (UART2_IsReceiveDataAvailable())
    {
        char c = (char)UART2_Read();
        if ((c == '\r') || (c == '\n'))
        {
            if (len > 0U)
            {
                line[len] = '\0';
                DEBUG_Printf("IOTC: event %s\r\n", line);
                if (strstr(line, "+MQTTCONN:1") != NULL)
                {
                    mqttLinkUp = true;
                }
                else if (strstr(line, "+MQTTCONN:0") != NULL)
                {
                    mqttLinkUp = false;
                }
                else if (strstr(line, "+WSTAAIP:") != NULL)
                {
                    /* The leading number is a per-association counter, not
                     * a fixed interface id - it increments every time the
                     * module reconnects (seen going 1 -> 3 after adding an
                     * explicit AT+WSTA=0/1 disconnect+reconnect cycle), so
                     * matching only ":1" missed every later reconnect. */
                    netUp = true;
                }
                else if (strstr(line, "+WSTALU:0") != NULL)
                {
                    netUp = false;
                    mqttLinkUp = false;
                }
                else if (strstr(line, "20.2") != NULL)
                {
                    /* The module reports this when STA is already connected. */
                    netUp = true;
                }
                else if (strncmp(line, "+MQTTSUBRX:", 11) == 0)
                {
                    /* Observed format: +MQTTSUBRX:<DUP>,<QOS>,<RETAIN>,"<TOPIC_NAME>","<PAYLOAD>"
                     * (confirmed against real hardware - the module inlines
                     * the payload here rather than requiring a follow-up
                     * AT+MQTTSUBRD for messages under its read threshold; see
                     * the pendingC2dPayload comment above). Deliberately does
                     * not act on the message from here - iotcl_mqtt_receive_c2d_with_length()
                     * may itself publish a command ack (an AT command), and
                     * this function runs nested inside other in-flight
                     * IOTC_RNWF11_Command() calls elsewhere in this file, so a
                     * nested command here would stomp the shared lastResponse
                     * buffer out from under the outer call. Task() picks the
                     * stored payload up instead, from its own top-level call. */
                    const char *p = line + 11;
                    for (uint8_t skip = 0; (skip < 3U) && (p != NULL); skip++)
                    {
                        p = strchr(p, ',');
                        if (p != NULL)
                        {
                            p++;
                        }
                    }
                    if ((p != NULL) && (*p == '"'))
                    {
                        char discardTopic[IOTC_RNWF11_C2D_TOPIC_MAX];
                        const char *afterTopic = IOTC_RNWF11_UnescapeQuotedString(p + 1, discardTopic, sizeof(discardTopic), NULL);
                        if ((afterTopic != NULL) && (*afterTopic == ',') && (*(afterTopic + 1) == '"'))
                        {
                            size_t payloadLen = 0;
                            const char *afterPayload = IOTC_RNWF11_UnescapeQuotedString(afterTopic + 2, pendingC2dPayload,
                                                                                         sizeof(pendingC2dPayload), &payloadLen);
                            if (afterPayload != NULL)
                            {
                                pendingC2dPayloadLen = payloadLen;
                                pendingC2dMessage = true;
                            }
                        }
                    }
                }
                len = 0;
            }
        }
        else if (len < (sizeof(line) - 1U))
        {
            line[len++] = c;
        }
    }
}

void IOTC_RNWF11_Task(void)
{
#if IOTC_RNWF11_ENABLE
    if (!iotcModulePresent || !IOTC_RNWF11_IsConfigured())
    {
        return;
    }
    IOTC_RNWF11_PollEvents();
    if (!iotcConnected)
    {
        if (!netUp)
        {
            return;
        }
        if (retryMilliseconds < IOTC_RETRY_PERIOD_MS)
        {
            return;
        }
        retryMilliseconds = 0;
        /* Clear any stale value from a prior session before this attempt -
         * a genuine "+MQTTCONN:1" during Configure() below (processed via
         * its own PollEvents() calls) sets this back to true; unconditionally
         * clearing it AFTER Configure() returns (as this used to do) stomped
         * on that real success every single time, making a connection that
         * actually worked look immediately "not connected" on the very next
         * check and forcing a pointless reconnect before telemetry ever had
         * a chance to publish. */
        mqttLinkUp = false;
        iotcConnected = IOTC_RNWF11_Configure();
        DEBUG_Printf("IOTC: provisioning %s\r\n", iotcConnected ? "complete" : "failed");
#if IOTC_DIAG_QUERIES
        IOTC_RNWF11_Diagnose();
#endif
        telemetryMilliseconds = 0;
        return;
    }
    if (pendingC2dMessage)
    {
        pendingC2dMessage = false;
        DEBUG_Printf("IOTC: C2D message (%u bytes): %s\r\n", (unsigned)pendingC2dPayloadLen, pendingC2dPayload);
        (void)iotcl_mqtt_receive_c2d_with_length((const uint8_t *)pendingC2dPayload, pendingC2dPayloadLen);
    }
    if (telemetryMilliseconds >= IOTC_TELEMETRY_PERIOD_MS)
    {
        telemetryMilliseconds = 0;
        if (!mqttLinkUp)
        {
            DEBUG_Printf("IOTC: broker not connected, retrying\r\n");
            iotcConnected = false;
            retryMilliseconds = 0;
            return;
        }
        bool sent = IOTC_RNWF11_PublishTelemetry();
        DEBUG_Printf("IOTC: publish %s state=%u rpm=%u duty=%d\r\n",
                 sent ? "ok" : "FAILED",
                 telemetry.state, telemetry.measuredSpeedRpm, telemetry.dutyCycle);
    }
#endif
}

bool IOTC_RNWF11_IsConnected(void)
{
    return iotcConnected;
}
